# AnalyticalAdjacentSpace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalAdjacentSpace Property
ParameterTypeId Class See Also
---
"Adjacent Analytical Space"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalAdjacentSpace { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalAdjacentSpace As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalAdjacentSpace {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace